app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def show
    task_id = params[:id].to_i
    @task = Task.all[task_id]